Revit 2024 API
ParameterTypeId.NumberSystemOrientation Property
 "Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId NumberSystemOrientation { get; }
Visual Basic
Public Shared ReadOnly Property NumberSystemOrientation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ NumberSystemOrientation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace